; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v1 - type_1 ?v5 - type_2)
 	      (pred_2 ?v3 - object ?v5 - type_2)
	      (pred_1 ?v1 - type_1 ?v6 - type_3)
	      (pred_4 ?v1 - type_1 ?v3 - object ?v6 - type_3))

   (:action op_3
       :parameters  (?v1 - type_1 ?v8 ?v7 - type_2)
       :precondition (and  (pred_3 ?v1 ?v8))
       :effect (and  (pred_3 ?v1 ?v7)
		     (not (pred_3 ?v1 ?v8))))

   (:action op_1
       :parameters (?v1 - type_1 ?v2 - object ?v4 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v4) (pred_3 ?v1 ?v4) (pred_1 ?v1 ?v6))
       :effect (and (pred_4 ?v1 ?v2 ?v6)
		    (not (pred_2 ?v2 ?v4)) 
		    (not (pred_1 ?v1 ?v6))))

   (:action op_2
       :parameters (?v1 - type_1 ?v2 - object ?v4 - type_2 ?v6 - type_3)
       :precondition  (and  (pred_4 ?v1 ?v2 ?v6) (pred_3 ?v1 ?v4))
       :effect (and (pred_2 ?v2 ?v4)
		    (pred_1 ?v1 ?v6)
		    (not (pred_4 ?v1 ?v2 ?v6)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_01 - type_1
obj_06 obj_04 obj_08 obj_07 - type_3
obj_10 obj_11 obj_02 obj_12 - type_2
obj_03 obj_09 obj_13 - object)
(:init
(pred_3 obj_05 obj_12)
(pred_1 obj_05 obj_06)
(pred_1 obj_05 obj_04)
(pred_3 obj_01 obj_11)
(pred_1 obj_01 obj_08)
(pred_1 obj_01 obj_07)
(pred_2 obj_03 obj_11)
(pred_2 obj_09 obj_02)
(pred_2 obj_13 obj_10)
)
(:goal
(and
(pred_2 obj_03 obj_12)
(pred_2 obj_09 obj_10)
(pred_2 obj_13 obj_10)
)
)

(:constraints
  (always (not (pred_3 obj_05 obj_02)))
)
)

; plan
1. (op_1 obj_01 obj_03 obj_11 obj_07)
   deleted: (pred_2 obj_03 obj_11) (pred_1 obj_01 obj_07)
   added: (pred_4 obj_01 obj_03 obj_07)
   goals met: 1 of 3
2. (op_3 obj_05 obj_12 obj_10)
   deleted: (pred_3 obj_05 obj_12)
   added: (pred_3 obj_05 obj_10)
   goals met: 1 of 3
3. (op_3 obj_01 obj_11 obj_12)
   deleted: (pred_3 obj_01 obj_11)
   added: (pred_3 obj_01 obj_12)
   goals met: 1 of 3
4. (op_2 obj_01 obj_03 obj_12 obj_07)
   deleted: (pred_4 obj_01 obj_03 obj_07)
   added: (pred_2 obj_03 obj_12) (pred_1 obj_01 obj_07)
   goals met: 2 of 3
5. (op_3 obj_01 obj_12 obj_02)
   deleted: (pred_3 obj_01 obj_12)
   added: (pred_3 obj_01 obj_02)
   goals met: 2 of 3
6. (op_1 obj_01 obj_09 obj_02 obj_07)
   deleted: (pred_2 obj_09 obj_02) (pred_1 obj_01 obj_07)
   added: (pred_4 obj_01 obj_09 obj_07)
   goals met: 2 of 3
7. (op_3 obj_01 obj_02 obj_10)
   deleted: (pred_3 obj_01 obj_02)
   added: (pred_3 obj_01 obj_10)
   goals met: 2 of 3
8. (op_2 obj_01 obj_09 obj_10 obj_07)
   deleted: (pred_4 obj_01 obj_09 obj_07)
   added: (pred_2 obj_09 obj_10) (pred_1 obj_01 obj_07)
   goals met: 3 of 3
